###############################################################################
# Created by write_sdc
# Tue Feb 17 11:50:26 2026
###############################################################################
current_design riscv_pipeline_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 50.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARREADY}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWREADY}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_BRESP[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_BRESP[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_BVALID}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[28]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[29]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[30]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[31]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RDATA[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RRESP[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RRESP[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RVALID}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WREADY}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[11]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[12]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[13]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[14]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[15]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[16]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[17]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[18]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[19]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[20]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[21]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[22]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[23]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[24]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[25]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[26]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[27]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[28]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[29]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[30]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[31]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARADDR[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_ARVALID}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[11]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[12]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[13]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[14]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[15]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[16]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[17]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[18]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[19]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[20]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[21]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[22]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[23]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[24]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[25]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[26]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[27]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[28]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[29]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[30]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[31]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWADDR[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_AWVALID}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_BREADY}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_RREADY}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[11]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[12]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[13]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[14]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[15]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[16]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[17]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[18]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[19]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[20]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[21]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[22]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[23]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[24]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[25]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[26]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[27]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[28]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[29]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[30]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[31]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WDATA[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WSTRB[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WSTRB[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WSTRB[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WSTRB[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {M_AXI_WVALID}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {M_AXI_ARVALID}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWVALID}]
set_load -pin_load 0.0334 [get_ports {M_AXI_BREADY}]
set_load -pin_load 0.0334 [get_ports {M_AXI_RREADY}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WVALID}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[31]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[30]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[29]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[28]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[27]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[26]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[25]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[24]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[23]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[22]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[21]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[20]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[19]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[18]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[17]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[16]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[15]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[14]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[13]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[12]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[11]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[10]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[9]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[8]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[7]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[6]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[5]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[4]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[3]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[2]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[1]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_ARADDR[0]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[31]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[30]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[29]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[28]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[27]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[26]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[25]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[24]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[23]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[22]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[21]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[20]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[19]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[18]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[17]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[16]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[15]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[14]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[13]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[12]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[11]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[10]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[9]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[8]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[7]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[6]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[5]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[4]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[3]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[2]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[1]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_AWADDR[0]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[31]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[30]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[29]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[28]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[27]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[26]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[25]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[24]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[23]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[22]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[21]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[20]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[19]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[18]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[17]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[16]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[15]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[14]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[13]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[12]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[11]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[10]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[9]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[8]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[7]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[6]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[5]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[4]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[3]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[2]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[1]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WDATA[0]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WSTRB[3]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WSTRB[2]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WSTRB[1]}]
set_load -pin_load 0.0334 [get_ports {M_AXI_WSTRB[0]}]
set_load -pin_load 0.0334 [get_ports {led[9]}]
set_load -pin_load 0.0334 [get_ports {led[8]}]
set_load -pin_load 0.0334 [get_ports {led[7]}]
set_load -pin_load 0.0334 [get_ports {led[6]}]
set_load -pin_load 0.0334 [get_ports {led[5]}]
set_load -pin_load 0.0334 [get_ports {led[4]}]
set_load -pin_load 0.0334 [get_ports {led[3]}]
set_load -pin_load 0.0334 [get_ports {led[2]}]
set_load -pin_load 0.0334 [get_ports {led[1]}]
set_load -pin_load 0.0334 [get_ports {led[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_ARREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_AWREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_BVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_WREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_BRESP[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_BRESP[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RDATA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RRESP[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_AXI_RRESP[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
